Repository: justrunme/adguard-dns-toggle
Catalog: AdGuardDNSController/Resources/*.lproj/Localizable.strings
Languages: de, ru

# Запускать при входе в систему
source: Launch at login
de: Beim Login starten
ru: Запускать при входе в систему

# Язык интерфейса:
source: Interface language:
de: Sprache der Benutzeroberfläche:
ru: Язык интерфейса:

# Настройки
source: Preferences
de: Einstellungen
ru: Настройки

# Настройки...
source: Preferences...
de: Einstellungen...
ru: Настройки...

# Включить защиту
source: Enable protection
de: Schutz aktivieren
ru: Включить защиту

# Выключить защиту
source: Disable protection
de: Schutz deaktivieren
ru: Выключить защиту

# Показать диагностику
source: Show diagnostics
de: Diagnose anzeigen
ru: Показать диагностику

# Открыть главное окно
source: Open main window
de: Hauptfenster öffnen
ru: Открыть главное окно

# Перезапустить демон
source: Restart daemon
de: Daemon neu starten
ru: Перезапустить демон

# Выход
source: Quit
de: Beenden
ru: Выход

# DNS серверы
source: DNS servers
de: DNS-Server
ru: DNS серверы

# Интерфейс
source: Interface
de: Schnittstelle
ru: Интерфейс

# Время работы
source: Uptime
de: Betriebszeit
ru: Время работы

# Память
source: Memory
de: Speicher
ru: Память

# Задержка
source: Latency
de: Latenz
ru: Задержка

# Версия
source: Version
ru: Версия

# AdGuard DNS неактивен
source: AdGuard DNS is inactive
de: AdGuard DNS ist inaktiv
ru: AdGuard DNS неактивен

# AdGuard DNS активен
source: AdGuard DNS is active
de: AdGuard DNS ist aktiv
ru: AdGuard DNS активен

# Защита неактивна
source: Protection is inactive
de: Schutz ist inaktiv
ru: Защита неактивна

# Защита активна
source: Protection is active
de: Schutz ist aktiv
ru: Защита активна

# Системный
source: System
de: Systemsprache
ru: Системный

# Требуется перезапуск
source: Restart required
de: Neustart erforderlich
ru: Требуется перезапуск

# Для применения языка перезапустите приложение.
source: Restart the app to apply the language.
de: Starten Sie die App neu, um die Sprache anzuwenden.
ru: Для применения языка перезапустите приложение.

# Проверить систему
source: Check system
de: System prüfen
ru: Проверить систему

# Проверить состояние системы и зависимостей.
source: Check system and dependencies.
de: System- und Abhängigkeitsstatus prüfen.
ru: Проверить состояние системы и зависимостей.

# Скопировать лог
source: Copy log
de: Log kopieren
ru: Скопировать лог

# Скопировать содержимое лога в буфер обмена.
source: Copy log contents to clipboard.
de: Log-Inhalt in die Zwischenablage kopieren.
ru: Скопировать содержимое лога в буфер обмена.

# Лог-файл не найден.
source: Log file not found.
de: Logdatei nicht gefunden.
ru: Лог-файл не найден.

source: If you see the error 'file doesn't exist', check utility paths. If PID file exists: false, check if the daemon is running.
de: Wenn Sie den Fehler 'file doesn't exist' sehen, überprüfen Sie die Dienstprogramme. Wenn PID file exists: false, prüfen Sie, ob der Daemon läuft.
ru: Если видите ошибку 'file doesn't exist' — проверьте пути к утилитам. Если PID file exists: false — проверьте, запущен ли демон.

# Не удалось определить
source: Could not determine
de: Konnte nicht ermittelt werden
ru: Не удалось определить

# Неизвестно
source: Unknown
de: Unbekannt
ru: Неизвестно

# Не запущен
source: Not running
de: Nicht gestartet
ru: Не запущен

# Нет соединения
source: No connection
de: Keine Verbindung
ru: Нет соединения

# Загрузка...
source: Loading...
de: Lädt...
ru: Загрузка...

# Причина: %@
source: Reason: %@
de: Grund: %@
ru: Причина: %@

# ✓ %@ найден, права: %@
source: ✓ %@ found, permissions: %@
de: ✓ %@ gefunden, Berechtigungen: %@
ru: ✓ %@ найден, права: %@

# ✓ %@ найден, права: неизвестно
source: ✓ %@ found, permissions: unknown
de: ✓ %@ gefunden, Berechtigungen: unbekannt
ru: ✓ %@ найден, права: неизвестно

# ✗ %@ не найден
source: ✗ %@ not found
de: ✗ %@ nicht gefunden
ru: ✗ %@ не найден

# ✗ Нет прав на запись в /tmp
source: ✗ No write permission to /tmp
de: ✗ Keine Schreibrechte für /tmp
ru: ✗ Нет прав на запись в /tmp

# ✓ DNS 127.0.0.1 прописан для интерфейса Wi-Fi
source: ✓ DNS 127.0.0.1 is set for Wi-Fi interface
de: ✓ DNS 127.0.0.1 ist für das Wi-Fi-Interface gesetzt
ru: ✓ DNS 127.0.0.1 прописан для интерфейса Wi-Fi

# ✗ DNS не задан для Wi-Fi
source: ✗ DNS not set for Wi-Fi
de: ✗ DNS für Wi-Fi nicht gesetzt
ru: ✗ DNS не задан для Wi-Fi

# ✓ DNS для Wi-Fi: %@
source: ✓ DNS for Wi-Fi: %@
de: ✓ DNS für Wi-Fi: %@
ru: ✓ DNS для Wi-Fi: %@

# ✗ Не удалось проверить DNS для Wi-Fi
source: ✗ Could not check DNS for Wi-Fi
de: ✗ DNS für Wi-Fi konnte nicht geprüft werden
ru: ✗ Не удалось проверить DNS для Wi-Fi

# Уведомления
source: Notifications
de: Benachrichtigungen
ru: Уведомления

# Показывать уведомления о статусе защиты
source: Show protection status notifications
de: Benachrichtigungen über Schutzstatus anzeigen
ru: Показывать уведомления о статусе защиты

# Мониторинг соединения с AdGuard DNS
source: Connection monitoring with AdGuard DNS
de: Verbindungsüberwachung mit AdGuard DNS
ru: Мониторинг соединения с AdGuard DNS

# Защита включена
source: Protection enabled
de: Schutz aktiviert
ru: Защита включена

# AdGuard DNS защита теперь активна
source: AdGuard DNS protection is now active
de: AdGuard DNS-Schutz ist jetzt aktiv
ru: AdGuard DNS защита теперь активна

# Защита выключена
source: Protection disabled
de: Schutz deaktiviert
ru: Защита выключена

# AdGuard DNS защита отключена
source: AdGuard DNS protection is disabled
de: AdGuard DNS-Schutz ist deaktiviert
ru: AdGuard DNS защита отключена

# Ошибка AdGuard DNS
source: AdGuard DNS Error
de: AdGuard DNS-Fehler
ru: Ошибка AdGuard DNS

# Демон запущен
source: Daemon started
de: Daemon gestartet
ru: Демон запущен

# AdGuard DNS демон успешно запущен
source: AdGuard DNS daemon started successfully
de: AdGuard DNS-Daemon erfolgreich gestartet
ru: AdGuard DNS демон успешно запущен

# Демон остановлен
source: Daemon stopped
de: Daemon gestoppt
ru: Демон остановлен

# AdGuard DNS демон остановлен
source: AdGuard DNS daemon stopped
de: AdGuard DNS-Daemon gestoppt
ru: AdGuard DNS демон остановлен

# Соединение восстановлено
source: Connection restored
de: Verbindung wiederhergestellt
ru: Соединение восстановлено

# Соединение с AdGuard DNS серверами восстановлено
source: Connection to AdGuard DNS servers restored
de: Verbindung zu AdGuard DNS-Servern wiederhergestellt
ru: Соединение с AdGuard DNS серверами восстановлено

# Соединение потеряно
source: Connection lost
de: Verbindung verloren
ru: Соединение потеряно

# Потеряно соединение с AdGuard DNS серверами
source: Connection to AdGuard DNS servers lost
de: Verbindung zu AdGuard DNS-Servern verloren
ru: Потеряно соединение с AdGuard DNS серверами

# Не удалось отправить команду daemon'у
source: Failed to send command to daemon
de: Befehl konnte nicht an den Daemon gesendet werden
ru: Не удалось отправить команду daemon'у

# Выключение...
source: Disabling...
de: Deaktivierung...
ru: Выключение...

# Включение...
source: Enabling...
de: Aktivierung...
ru: Включение...

# Добро пожаловать!
source: Welcome!
de: Willkommen!
ru: Добро пожаловать!

# Защита одним кликом
source: One-click protection
de: Ein-Klick-Schutz
ru: Защита одним кликом

# Включайте и выключайте AdGuard DNS защиту мгновенно
source: Enable and disable AdGuard DNS protection instantly
de: Aktivieren und deaktivieren Sie AdGuard DNS-Schutz sofort
ru: Включайте и выключайте AdGuard DNS защиту мгновенно

# Мониторинг в реальном времени
source: Real-time monitoring
de: Echtzeit-Überwachung
ru: Мониторинг в реальном времени

# Следите за статусом, задержкой и использованием ресурсов
source: Monitor status, latency and resource usage
de: Überwachen Sie Status, Latenz und Ressourcenverbrauch
ru: Следите за статусом, задержкой и использованием ресурсов

# Гибкие настройки
source: Flexible settings
de: Flexible Einstellungen
ru: Гибкие настройки

# Настраивайте DNS серверы, уведомления и автозапуск
source: Configure DNS servers, notifications and autostart
de: Konfigurieren Sie DNS-Server, Benachrichtigungen und Autostart
ru: Настраивайте DNS серверы, уведомления и автозапуск

# Начать
source: Get Started
de: Loslegen
ru: Начать

# Показать приветствие
source: Show welcome
ru: Показать приветствие

# AdGuard DNS: Включено
source: AdGuard DNS: Enabled
ru: AdGuard DNS: Включено

# AdGuard DNS: Выключено
source: AdGuard DNS: Disabled
ru: AdGuard DNS: Выключено

# Ошибка
source: Error
ru: Ошибка

# AdGuard DNS Toggle — быстрый доступ
source: AdGuard DNS Toggle — quick access
ru: AdGuard DNS Toggle — быстрый доступ

# Включить или выключить защиту AdGuard DNS.
source: Enable or disable AdGuard DNS protection.
ru: Включить или выключить защиту AdGuard DNS.

# Диагностика
source: Diagnostics
ru: Диагностика

# Автозапуск
source: Autostart
ru: Автозапуск

# Звуковые уведомления
source: Sound notifications
de: Tonbenachrichtigungen
ru: Звуковые уведомления

# Воспроизводить звук при уведомлениях
source: Play sound with notifications
ru: Воспроизводить звук при уведомлениях

# Уведомления о блокировке
source: Blocking notifications
ru: Уведомления о блокировке

# Показывать уведомления о заблокированной рекламе
source: Show notifications about blocked ads
ru: Показывать уведомления о заблокированной рекламе

# DNS сервер AdGuard
source: AdGuard DNS server
ru: DNS сервер AdGuard

# Выберите DNS сервер AdGuard
source: Select AdGuard DNS server
ru: Выберите DNS сервер AdGuard

source: Default
ru: По умолчанию

source: Family Protection
ru: Семейная защита

source: Unfiltered
ru: Без фильтрации

# Порт DNS
source: DNS Port
ru: Порт DNS

# Порт для локального DNS сервера
source: Port for local DNS server
ru: Порт для локального DNS сервера

# Пользовательские DNS
source: Custom DNS
ru: Пользовательские DNS

# Дополнительные DNS серверы (по одному на строку)
source: Additional DNS servers (one per line)
ru: Дополнительные DNS серверы (по одному на строку)

# Автопереключение при смене сети
source: Auto-switch on network change
ru: Автопереключение при смене сети

# Автоматически включать защиту при подключении к новой сети
source: Automatically enable protection when connecting to a new network
ru: Автоматически включать защиту при подключении к новой сети

# Применить
source: Apply
ru: Применить

# Отмена
source: Cancel
ru: Отмена

# Сбросить
source: Reset
ru: Сбросить

# Настройки сохранены
source: Settings saved
ru: Настройки сохранены

# Настройки успешно применены
source: Settings applied successfully
ru: Настройки успешно применены

# Ошибка сохранения
source: Save error
ru: Ошибка сохранения

# Не удалось сохранить настройки
source: Failed to save settings
ru: Не удалось сохранить настройки

source: Command pipe not found at: %@
de: Befehls-Pipe nicht gefunden unter: %@

source: AdGuard DNS daemon is not running
de: AdGuard DNS-Daemon läuft nicht

source: Failed to send command: %@
de: Befehl konnte nicht gesendet werden: %@

source: Invalid PID in daemon file
de: Ungültige PID in der Daemon-Datei

source: Process with PID %d not found
de: Prozess mit PID %d nicht gefunden

source: Access denied to file: %@
de: Zugriff auf Datei verweigert: %@

source: Configuration error: %@
de: Konfigurationsfehler: %@

source: Try restarting the daemon or check if it's running
de: Versuchen Sie, den Daemon neu zu starten oder prüfen Sie, ob er läuft

source: Start the daemon using the launch agent
de: Starten Sie den Daemon mit dem LaunchAgent

source: Check daemon logs for more information
de: Prüfen Sie die Daemon-Logs für weitere Informationen

source: Remove the PID file and restart the daemon
de: Entfernen Sie die PID-Datei und starten Sie den Daemon neu

source: The daemon process may have crashed. Restart it.
de: Der Daemon-Prozess ist möglicherweise abgestürzt. Starten Sie ihn neu.

source: Check file permissions and try again
de: Überprüfen Sie die Dateiberechtigungen und versuchen Sie es erneut

source: Verify configuration files and paths
de: Überprüfen Sie die Konfigurationsdateien und Pfade

# DNS настройки
source: DNS Settings
de: DNS-Einstellungen

# DNS серверы AdGuard:
source: AdGuard DNS servers:
de: AdGuard DNS-Server:

source: Default (176.103.130.130)
de: Standard (176.103.130.130)

source: Family (176.103.130.132)
de: Familie (176.103.130.132)

source: Non-filtering (176.103.130.131)
de: Nicht filternd (176.103.130.131)

# Пользовательские
source: Custom
de: Benutzerdefiniert

# Пользовательские DNS (через запятую):
source: Custom DNS servers (comma-separated):
de: Benutzerdefinierte DNS-Server (kommagetrennt):

# Автоматически переключать при смене сети
source: Auto-switch on network change
de: Automatisch bei Netzwerkwechsel umschalten

# Открыть приложение
source: Open app
de: App öffnen

# Реклама заблокирована
source: Ad blocked
de: Werbung blockiert

# Заблокирован домен: %@
source: Blocked domain: %@
de: Blockierte Domain: %@

# Заблокировано %d рекламных запросов
source: Blocked %d ad requests
de: %d Werbeanfragen blockiert

# Статистика за день
source: Daily statistics
de: Tagesstatistik

# Заблокировано %d из %d запросов
source: Blocked %d out of %d requests
de: %d von %d Anfragen blockiert

# Общие
source: General
de: Allgemein
